Instrument(length?, int DEven): InstrumentResult

var res = Instrument(length?, int DEven)

var Instruments = res.split(';').map(i => {
	var row = i.split(',');
	return {
		InsCode      : row[0],  // int64
			// کد داخلی نماد 
			// در تمام اطلاعات از این کد برای شناسایی نماد استفاده می شود
			// این کد برای هر نماد یکتا بوده و درهنگام اضافه شدن هر نماد جدید به بورس در بانک اطلاعاتی وب سایت شرکت مدیریت فناوری بورس ساخته می شود
		InstrumentID : row[1],  // string کد 12 رقمي لاتين نماد
		LatinSymbol  : row[2],  // string
		LatinName    : row[3],  // string
		CompanyCode  : row[4],  // string
		Symbol       : row[5],  // string
		Name         : row[6],  // string
		CIsin        : row[7],  // string کد 12 رقمي شرکت
		DEven        : row[8],  // int32 	تاريخ - نمادهايي که در آخرين روز معاملاتي وجود نداشته باشند داراي تاريخ قديمي بوده و قابل شناسايي هستند
		Flow         : row[9],  // byte بازار
		[
			0, 'عمومي - مشترک بين بورس و فرابورس',
			1, 'بورس',
			2, 'فرابورس',
			3, 'آتی',
			4, 'پایه فرابورس',
			5, 'پایه فرابورس - منتشر نمی شود',
			6, 'بورس انرژی',
			7, 'بورس کالا',
		] 
		LSoc30       : row[10], // string نام 30 رقمي فارسي شرکت
		CGdSVal      : row[11], // string نوع نماد يکي از مقادير: A - I - O
		CGrValCot    : row[12], // string کد گروه نماد
			['00','11','1A','21','41','61','71','91','C1','D1','G1','H1','I1','J1','L1','N1','N2','N4','P1','R1','T1','U1','V1','W1','Z1']
		YMarNSC      : row[13], // string کد بازار
		[
			'NO', 'Normal market',
			'OL', 'Odd-lot market',
			'BK', 'Block market',
			'BY', 'Buying-in market',
			'ID', 'Index market',
			'UI', 'instruments',
		]    
		CComVal      : row[14], // string کد تابلو
		[
			1, 'تابلوی اصلی',
			3, 'تابلوی فرعی',
			4, 'نماد قدیمی حذف شده ؟',
			5, 'بازار دوم ؟',
			6, 'شاخص ؟',
			7, 'فرابورس - پایه ؟',
			8, 'اختیار ؟',
			9, 'اوراق صکوک ؟',
		]
		CSecVal      : row[15], // string کد گروه صنعت
			[]62
		[
			01, 'زراعت و خدمات وابسه',
			02, 'جنگلداری و ماهیگیری',
			10, 'استخراج زغال سنگ',
			11, 'استخراج نفت، گاز و خدمات جنبی جز اکشتاف',
			13, 'استخراج کانه های فلزی',
			14, 'استخراج سایر معادن',
			17, 'منسوجات',
			19, 'دباغی، پرداخت چرم و ساخت انواع پاپوش',
			20, 'محصولات چوبی',
			21, 'محصولات کاغذی',
			22, 'انتشار، چاپ و تکثیر',
			23, 'فرآورده های نفتی، کک و سوخته هسته ایی',
			25, 'لاستیک و پلاستیک',
			26, 'تولید محصولات کامپیوتری، الکترونیکی و نوری',
			27, 'فلزات اساسی',
			28, 'ساخت محصولات فلزی',
			29, 'ماشین آلات و تجهیزات',
			31, 'ماشین آلات و دستگاه های برقی',
			32, 'ساخت دستگاه ها و وسایل ارتباطی',
			33, 'ابزار پزشکی، اپتیکی و اندازه گیری',
			34, 'خودرو و ساخت قطعات',
			35, 'سایر تجهیزات حمل و نقل',
			36, 'مبلمان و مصنوعات دیگر',
			38, 'قند و شکر',
			39, 'شرکت های چند رشته ای صنعتی',
			40, 'عرضه برق، گاز، بخار و آب گرم',
			42, 'محصولات غذایی و آشامیدنی به جز قند و شکر',
			43, 'مواد و محصولات دارویی',
			44, 'محصولات شیمیایی',
			45, 'پیمانکاری صنعتی',
			46, 'تجارت عمده فروشی به جز وسایل نقلیه موتور',
			47, 'خرده فروشی به استثنای وسایل نقلیه موتوری',
			49, 'کاشی و سرامیک',
			50, 'تجارت عمده و خرده فروشی وسایل نقلیه موتور',
			51, 'حمل و نقل هوایی',
			52, 'انبارداری و حمایت از فعالیت های حمل و نقل',
			53, 'سیمان، آهک و گچ',
			54, 'سایر محصولات کانی غیر فلزی',
			55, 'هتل و رستوران',
			56, 'سرمایه گذاری ها',
			57, 'بانک ها و موسسات اعتباری',
			58, 'سایر واسطه گری های مالی',
			59, 'اوراق حق تقدم استفاده از تصحیلات مسکن',
			60, 'حمل و نقل، انبارداری و ارتباطات',
			61, 'حمل و نقل آبی',
			64, 'مخابرات',
			65, 'واسطه گری های مالی و پولی',
			66, 'بیمه و صندوق بازنشستگی به جز تامین اجتماعی',
			67, 'فعالیت های کمکی به نهاد های مالی واسط',
			68, 'صندوق سرمایه گذاری قابل معامله',
			69, 'اوراق تامین مالی',
			70, 'انبوه سازی، املاک و مستغلات',
			71, 'فعالیت مهندسی، تجزیه، تحلیل و آزمایش فنی',
			72, 'رایانه و فعالیت های وابسته به آن',
			73, 'اطلاعات و ارتباطات',
			74, 'خدمات فنی و مهندسی',
			76, 'اوراق بهادار مبتنی بر دارایی فکری',
			77, 'فعالیت های اجاره و لیزینگ',
			82, 'فعالیت پشتیبانی اجرایی اداری و حمایت کسب',
			90, 'فعالیت های هنری، سرگرمی و خلاقانه',
			98, 'تست',
			'X1', 'شاخص'
		]
		CSoSecVal    : row[16], // string کد زير گروه صنعت
			[]177
		YVal         : row[17]  // string نوع نماد
		[
			[ 67,  'شاخص',                        'شاخص قيمت' ],
			[ 68,  'شاخص',                        'شاخص' ],
			[ 208, 'اوراق مشاركت',                   'اوراق صكوك' ],
			[ 300, 'سهام عادی',                      'سهام' ],
			[ 305, 'صندوق سرمايه گذاري',               'صندوق سرمايه گذاري در سهام بورس' ],
			[ 309, 'تست پایه',                       'تست پایه' ],
			[ 321, 'اختیار فولاد هرمزگان',                '' ],
			[ 322, 'اختیار خ اخزا ( اسناد خزانه داری اسلامی )', '' ],
			[ 323, 'اختیارف اخزا ( اسناد خزانه داری اسلامی )', '' ],
			[ 400, 'حق تقدم',                         'حق تقدم سهم' ],
			[ 69,  'شاخص',                         'شاخص فرابورس' ],
			[ 70,  'اوراق مشاركت',                    'صکوک اختصاصی' ],
			[ 303, 'سهام عادی',                       'اتیسی' ],
			[ 305, 'صندوق سرمايه گذاري',                'صندوق سرمايه گذاري در سهام بورس' ],
			[ 306, 'اوراق مشاركت',                    'اوراق مشارکت اتیسی' ],
			[ 307, 'سهام عادی',                       'تسهیلات فرابورس' ],
			[ 313, 'سهام عادی',                       'شرکتهای کوچک و متوسط' ],
			[ 403, 'حق تقدم',                         'حق تقدم اتیسی' ],
			[ 601, 'اختیار فروش تبعی ( ذوب آهن اصفهان)',     '' ],
			[ 706, 'اوراق مشاركت',                    'صکوک اختصاصی' ],
			[ 903, 'دارایی فکری',                      'دارایی فکری' ],
			[ 301, 'اوراق مشاركت',                    'اوراق مشارکت' ],
			[ 304, 'سهام عادی',                       'آتی' ],
			[ 311, 'سهام عادی',                       'اختیار خرید' ],
			[ 312, 'سهام عادی',                       'اختیار فروش' ],
			[ 600, 'اختیار',                          'اختیار فروش تبعی' ],
			[ 602, 'اختیار',                          'اختیار فروش تبعی فرابورس' ],
			[ 309, 'سهام عادی',                       'پایه' ],
			[ 404, 'حق تقدم',                         'حق تقدم پایه' ],
			[ 207, 'اوراق مشاركت',                    'اوراق مشارکت ارز صادراتی' ],
			[ 200, 'اوراق مشاركت',                    'اوراق مشارکت انرژی' ],
			[ 315, 'صندوق سرمايه گذاري',                'صندوق سرمایه گذاری قابل معامله انرژی' ],
			[ 801, 'سلف بورس انرژی',                   '' ],
			[ 802, 'سلف بورس انرژی',                   '' ],
			[ 803, 'سلف بورس انرژی',                   '' ],
			[ 804, 'سلف بورس انرژی',                   '' ],
			[ 901, 'انرژی',                           '' ],
			[ 902, 'انرژی',                           '' ],
			[ 308, 'اوراق مشاركت',                     'اوراق مشارکت کالا' ],
			[ 701, 'کالا',                             'گواهی سپرده کالایی' ]
		]
	};
});
function countOccurrence(types) {
	// instruments: [ Instrument, Instrument, ...]
	Object.keys(types).forEach(k => types[k][2] = 0);
	instruments.forEach(i => types[i.YVal] ? types[i.YVal][2] += 1 : undefined);
	return types;
}
function convertToLinkedList(types) {
	const l1 = [...new Set(Object.keys(types).map(i => types[i][0]))].map((v,i)=>({id: i+1, node: v, parent: '#'}));
	const l2 = Object.keys(types).map((k,i) => ({
		id: l1.length+i+1,
		parent: l1.find(j=>j.node===types[k][0]).id,
		node: types[k][1]
	}));
	return l1.concat(l2).filter(i => i.node);
}
