var CodalData = [
	[400043, '', '', 'گزارش فعالیت ماهانه دوره 1 ماهه منتهی به 1399/12/30(اصلاحیه)', '00/1/16 10:58', '00/1/16 10:58', 2, 1, 2, 0, []],
	[399124, '', '', 'گزارش فعالیت ماهانه دوره 1 ماهه منتهی به 1399/12/30', '00/1/8 11:21', '00/1/8 11:21', 2, 1, 2, 0, []],
	[398260, '', '', 'تصمیمات مجمع عمومی عادی به طور فوق العاده دوره 12 ماهه منتهی به 1399/12/30', '99/12/25 17:48', '99/12/25 17:48', 2, 0, 2, 0, [
		[312935, 'pdf', 'صورتجلسه مجمع عمومی عادی به طور فوق العاده 99.pdf']
	]],
	[398273, '', '', 'تصمیمات مجمع عمومی فوق العاده دوره 12 ماهه منتهی به 1399/12/30', '99/12/25 17:19', '99/12/25 17:19', 2, 0, 2, 0, [
		[312922, 'pdf', 'صورتجلسه مجمع عمومی فوق العاده99.pdf']
	]],
	[398386, '', '', 'آگهی دعوت به مجمع عمومی فوق العاده دوره 12 ماهه منتهی به 1399/12/30', '99/12/25 09:55', '99/12/25 09:55', 2, 0, 2, 0, [
		[312802, 'jpg', 'دنیای اقتصاد-فوق العاده.jpg'],
		[312803, 'jpg', 'ایران-فوق العاده.jpg'],
		[312804, 'jpg', 'تعادل-فوق العاده.jpg'],
		[312805, 'jpg', 'صمت-فوق العاده.jpg']
	]],
	[398392, '', '', 'مدارک و مستندات درخواست افزایش سرمایه', '99/12/25 09:33', '99/12/25 09:33', 2, 0, 2, 0, [
		[312797, 'pdf', 'گزارش توجیهی حسابرسی.pdf'],
		[312798, 'pdf', 'بیانیۀ ثبت-فولاد-991204 (2).pdf']
	]],
	[397591, '', '', 'آگهی دعوت به مجمع عمومی عادی بطور فوق العاده', '99/12/16 11:56', '99/12/16 11:56', 2, 0, 2, 0, [
		[311973, 'jpg', 'ایران-عادی به طور فوق العاده.jpg'],
		[311974, 'jpg', 'دنیای اقتصاد-عادی به طور فوق العاده.jpg'],
		[311975, 'jpg', 'تعادل-عادی به طور فوق العاده.jpg'],
		[311976, 'jpg', 'صمت-عادی به طور فوق العاده.jpg']
	]],
	[395827, '', '', 'گزارش فعالیت ماهانه دوره 1 ماهه منتهی به 1399/11/30', '99/12/4 10:16', '99/12/4 10:16', 2, 2, 2, 0, []],
	[237989, '', '', 'پیش بینی درآمد هر سهم سال مالی منتهی به 1396/12/29 بر اساس عملکرد واقعی 6 ماهه  (حسابرسی نشده)(اصلاحیه)', '96/8/3 12:06', '96/8/3 12:06', 2, 2, 2, 0, []],
	[237743, '', '', 'گزارش فعالیت ماهانه دوره 1 ماهه منتهی به 1396/07/30', '96/8/2 15:50', '96/8/2 15:50', 2, 2, 2, 0, []],
	[237150, '', '', 'پیش بینی درآمد هر سهم سال مالی منتهی به 1396/12/29 بر اساس عملکرد واقعی 6 ماهه  (حسابرسی نشده)', '96/7/27 13:38', '96/7/27 13:38', 2, 2, 2, 0, []],
	[219260, '', '', 'صورت‌های مالی تلفیقی سال مالی منتهی به 1395/12/30 (حسابرسی نشده)', '96/3/28 16:27', '96/3/28 16:27', 2, 2, 2, 0, [
		[168544, 'pdf', 'Financial Statement 1395.12.30.pdf']
	]],

];
ens('i', version);
ii = InstInfo();
ii.StartInstInfo()