// price
pf      // open
pmax    // high
pmin    // low
pl      // last
pc      // close
py      // yesterday
plc     // last change
plp     // last change %
pcc     // close change
pcp     // close change %

tmin    // day range min
tmax    // day range max

// trades
tno     // count
tvol    // volume
tval    // value

// bid (row 1 2 3)
pd1     // price
zd1     // count
qd1     // volume

// ask (row 1 2 3)
po1     // price
zo1     // count
qo1     // volume

// misc
l18     // symbol
l30     // name
bvol    // base volume
eps     // eps
pe      // p / e ratio
z       // total shares
mv      // market value
cs      // industry group


// customized column
cfield0
cfield1
cfield2

// must be enabled in settings:
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
// history
ih[n]   // n days ago
	.PriceFirst     // open
	.PriceMax       // high
	.PriceMin       // low
	.PDrCotVal      // last
	.PClosing       // close
	.PriceYesterday // yesterday
	.ZTotTran       // trades count
	.QTotTran5J     // trades vol
	.QTotCap        // trades value
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
// entity type

// natural person
ct.Buy_I_Volume  // buy  vol
ct.Sell_I_Volume // sell vol
ct.Buy_CountI    // buy  count
ct.Sell_CountI   // sell count

// legal person
ct.Buy_N_Volume  // buy  vol
ct.Sell_N_Volume // sell vol
ct.Buy_CountN    // buy  count
ct.Sell_CountN   // sell count
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
// statistical

//  آخرین روز
is13 // قیمت میانگین وزنی - بدون دخالت حجم مبنا
is14 // قیمت میانگین وزنی - با دخالت حجم مبنا
is15 // ارزش معاملات
is16 // حجم معاملات
is17 // دفعات معاملات
is36 // ارزش شرکت
is37 // رتبه ارزش شرکت

// در 3 ماه گذشته
is1  // میانگین ارزش معاملات
is3  // رتبه ارزش معاملات
is5  // میانگین حجم معاملات
is7  // رتبه حجم معاملات
is9  // میانگین دفعات معاملات روزانه
is11 // رتبه دفعات معاملات روزانه
is18 // تعداد روزهای منفی
is20 // درصد روزهای منفی
is22 // رتبه روزهای منفی
is24 // روزهای بدون معامله
is26 // تعداد روزهای مثبت
is28 // درصد روزهای مثبت
is30 // رتبه روزهای مثبت
is32 // روزهای با معامله
is34 // رتبه روزهای با معامله
is38 // تعداد روزهای باز
is40 // درصد روزهای باز
is42 // رتبه روزهای باز
is44 // تعداد روزهای بسته
is46 // درصد روزهای بسته
is48 // رتبه روزهای بسته
is50 // میانگین حجم خرید حقیقی
is52 // رتبه حجم خرید حقیقی
is54 // میانگین حجم خرید حقوقی
is56 // رتبه حجم خرید حقوقی
is58 // میانگین تعداد خریدار حقیقی
is60 // رتبه تعداد خریدار حقیقی
is62 // میانگین تعداد خریدار حقوقی
is64 // رتبه تعداد خریدار حقوقی
is66 // میانگین تعداد خریداران
is68 // رتبه تعداد خریداران
is70 // میانگین حجم فروش حقیقی
is72 // رتبه حجم فروش حقیقی
is74 // میانگین حجم فروش حقوقی
is76 // رتبه حجم فروش حقوقی
is78 // میانگین تعداد فروشنده حقیقی
is80 // رتبه تعداد فروشنده حقیقی
is82 // میانگین تعداد فروشنده حقوقی
is84 // رتبه تعداد فروشنده حقوقی
is86 // میانگین تعداد فروشندگان
is88 // رتبه تعداد فروشندگان

// در 12 ماه گذشته
is2  // میانگین ارزش معاملات
is4  // رتبه ارزش معاملات
is6  // میانگین حجم معاملات
is8  // رتبه حجم معاملات
is10 // میانگین دفعات معاملات روزانه
is12 // رتبه دفعات معاملات روزانه
is19 // تعداد روزهای منفی
is21 // درصد روزهای منفی
is23 // رتبه روزهای منفی
is25 // روزهای بدون معامله
is27 // تعداد روزهای مثبت
is29 // درصد روزهای مثبت
is31 // رتبه روزهای مثبت
is33 // روزهای با معامله
is35 // رتبه روزهای با معامله
is39 // تعداد روزهای باز
is41 // درصد روزهای باز
is43 // رتبه روزهای باز
is45 // تعداد روزهای بسته
is47 // درصد روزهای بسته
is49 // رتبه روزهای بسته
is51 // میانگین حجم خرید حقیقی
is53 // رتبه حجم خرید حقیقی
is55 // میانگین حجم خرید حقوقی
is57 // رتبه حجم خرید حقوقی
is59 // میانگین تعداد خریدار حقیقی
is61 // رتبه تعداد خریدار حقیقی
is63 // میانگین تعداد خریدار حقوقی
is65 // رتبه تعداد خریدار حقوقی
is67 // میانگین تعداد خریداران
is69 // رتبه تعداد خریداران
is71 // میانگین حجم فروش حقیقی
is73 // رتبه حجم فروش حقیقی
is75 // میانگین حجم فروش حقوقی
is77 // رتبه حجم فروش حقوقی
is79 // میانگین تعداد فروشنده حقیقی
is81 // رتبه تعداد فروشنده حقیقی
is83 // میانگین تعداد فروشنده حقوقی
is85 // رتبه تعداد فروشنده حقوقی
is87 // میانگین تعداد فروشندگان
is89 // رتبه تعداد فروشندگان
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@