DEven            // تاريخ
	// نمادھايي که در آخرين روز معاملاتي وجود نداشته باشند داراي تاريخ قديمي بوده و قابل شناسايي ھستند
InsCode          // کد داخلي نماد
	// در تمام اطلاعات از این کد برای شناسایی نماد استفاده می شود
	// این کد برای هر نماد یکتا بوده و درهنگام اضافه شدن هر نماد جدید به بورس در بانک اطلاعاتی وب سایت شرکت مدیریت فناوری بورس ساخته می شود
InstrumentID     // کد 12 رقمي لاتين نماد
CValMne          // کد 5 رقمي لاتين نماد
LVal18           // نام 18 رقمي لاتين نماد
CSocCSAC         // کد 5 رقمي لاتين شرکت
LSoc30           // نام 30 رقمي فارسي شرکت
LVal18AFC        // کد 18 رقمي فارسي نماد
LVal30           // نام 30 رقمي فارسي نماد
CIsin            // کد 12 رقمي شرکت
QNmVlo           // قيمت اسمي
ZTitad           // تعداد سهام - سرمايه
DESop            // تاريخ تغيير نماد
YOPSJ            // نوع تغيير امروز نماد
CGdSVal          // نوع نماد يکي از مقادير: A - I - O
CGrValCot        // کد گروه نماد
	['00','11','1A','21','41','61','71','91','C1','D1','G1','H1','I1','J1','L1','N1','N2','N4','P1','R1','T1','U1','V1','W1','Z1']
DInMar           // تاريخ اولين روز معاملاتي نماد
YUniExpP         // واحد قيمت - 1:قيمت - 2:درصد
YMarNSC          // کد بازار
	[
		['NO', 'Normal market'],
		['OL', 'Odd-lot market'],
		['BK', 'Block market'],
		['BY', 'Buying-in market'],
		['ID', 'Index market'],
		['UI', 'instruments'],
	]
CComVal          // کد تابلو
	[
		[1, 'تابلوی اصلی'],
		[3, 'تابلوی فرعی'],
		[4, 'نماد قدیمی حذف شده ؟'],
		[5, 'بازار دوم ؟'],
		[6, 'شاخص ؟'],
		[7, 'فرابورس - پایه ؟'],
		[8, 'اختیار ؟'],
		[9, 'اوراق صکوک ؟'],
	]
CSecVal          // کد گروه صنعت
	[]62
	[
		[01, 'زراعت و خدمات وابسه'],
		[02, 'جنگلداری و ماهیگیری'],
		[10, 'استخراج زغال سنگ'],
		[11, 'استخراج نفت، گاز و خدمات جنبی جز اکشتاف'],
		[13, 'استخراج کانه های فلزی'],
		[14, 'استخراج سایر معادن'],
		[17, 'منسوجات'],
		[19, 'دباغی، پرداخت چرم و ساخت انواع پاپوش'],
		[20, 'محصولات چوبی'],
		[21, 'محصولات کاغذی'],
		[22, 'انتشار، چاپ و تکثیر'],
		[23, 'فرآورده های نفتی، کک و سوخته هسته ای'],
		[25, 'لاستیک و پلاستیک'],
		[26, 'تولید محصولات کامپیوتری، الکترونیکی و نوری'],
		[27, 'فلزات اساسی'],
		[28, 'ساخت محصولات فلزی'],
		[29, 'ماشین آلات و تجهیزات'],
		[31, 'ماشین آلات و دستگاه های برقی'],
		[32, 'ساخت دستگاه ها و وسایل ارتباطی'],
		[33, 'ابزار پزشکی، اپتیکی و اندازه گیری'],
		[34, 'خودرو و ساخت قطعات'],
		[35, 'سایر تجهیزات حمل و نقل'],
		[36, 'مبلمان و مصنوعات دیگر'],
		[38, 'قند و شکر'],
		[39, 'شرکت های چند رشته ای صنعتی'],
		[40, 'عرضه برق، گاز، بخار و آب گرم'],
		[42, 'محصولات غذایی و آشامیدنی به جز قند و شکر'],
		[43, 'مواد و محصولات دارویی'],
		[44, 'محصولات شیمیایی'],
		[45, 'پیمانکاری صنعتی'],
		[46, 'تجارت عمده فروشی به جز وسایل نقلیه موتور'],
		[47, 'خرده فروشی به استثنای وسایل نقلیه موتوری'],
		[49, 'کاشی و سرامیک'],
		[50, 'تجارت عمده و خرده فروشی وسایل نقلیه موتور'],
		[51, 'حمل و نقل هوایی'],
		[52, 'انبارداری و حمایت از فعالیت های حمل و نقل'],
		[53, 'سیمان، آهک و گچ'],
		[54, 'سایر محصولات کانی غیر فلزی'],
		[55, 'هتل و رستوران'],
		[56, 'سرمایه گذاری ها'],
		[57, 'بانک ها و موسسات اعتباری'],
		[58, 'سایر واسطه گری های مالی'],
		[59, 'اوراق حق تقدم استفاده از تصحیلات مسکن'],
		[60, 'حمل و نقل، انبارداری و ارتباطات'],
		[61, 'حمل و نقل آبی'],
		[64, 'مخابرات'],
		[65, 'واسطه گری های مالی و پولی'],
		[66, 'بیمه و صندوق بازنشستگی به جز تامین اجتماعی'],
		[67, 'فعالیت های کمکی به نهاد های مالی واسط'],
		[68, 'صندوق سرمایه گذاری قابل معامله'],
		[69, 'اوراق تامین مالی'],
		[70, 'انبوه سازی، املاک و مستغلات'],
		[71, 'فعالیت مهندسی، تجزیه، تحلیل و آزمایش فنی'],
		[72, 'رایانه و فعالیت های وابسته به آن'],
		[73, 'اطلاعات و ارتباطات'],
		[74, 'خدمات فنی و مهندسی'],
		[76, 'اوراق بهادار مبتنی بر دارایی فکری'],
		[77, 'فعالیت های اجاره و لیزینگ'],
		[82, 'فعالیت پشتیبانی اجرایی اداری و حمایت کسب'],
		[90, 'فعالیت های هنری، سرگرمی و خلاقانه'],
		[98, 'تست'],
		['X1', 'شاخص'],
	]
CSoSecVal        // کد زير گروه صنعت
	[]177
YDeComp          // ميزان تاخير تصويه
PSaiSMaxOkValMdv // حداکثر قيمت مجاز
PSaiSMinOkValMdv // حداقل قيمت مجاز
BaseVol          // حجم مبنا
YVal             // نوع نماد
	[
		[67,  'شاخص',                        'شاخص قيمت'],
		[68,  'شاخص',                        'شاخص'],
		[208, 'اوراق مشاركت',                     'اوراق صكوك'],
		[300, 'سهام عادی',                       'سهام'],
		[305, 'صندوق سرمايه گذاري',                  'صندوق سرمايه گذاري در سهام بورس'],
		[309, 'تست پایه',                        'تست پایه'],
		[321, 'اختیار فولاد هرمزگان',                   ''],
		[322, 'اختیار خ اخزا ( اسناد خزانه داری اسلامی )',         ''],
		[323, 'اختیارف اخزا ( اسناد خزانه داری اسلامی )',         ''],
		[400, 'حق تقدم',                        'حق تقدم سهم'],
		[69,  'شاخص',                        'شاخص فرابورس'],
		[70,  'اوراق مشاركت',                     'صکوک اختصاصی'],
		[303, 'سهام عادی',                       'اتیسی'],
		[305, 'صندوق سرمايه گذاري',                  'صندوق سرمايه گذاري در سهام بورس'],
		[306, 'اوراق مشاركت',                     'اوراق مشارکت اتیسی'],
		[307, 'سهام عادی',                       'تسهیلات فرابورس'],
		[313, 'سهام عادی',                       'شرکتهای کوچک و متوسط'],
		[403, 'حق تقدم',                        'حق تقدم اتیسی'],
		[601, 'اختیار فروش تبعی ( ذوب آهن اصفهان)',           ''],
		[706, 'اوراق مشاركت',                     'صکوک اختصاصی'],
		[903, 'دارایی فکری',                      'دارایی فکری'],
		[301, 'اوراق مشاركت',                     'اوراق مشارکت'],
		[304, 'سهام عادی',                       'آتی'],
		[311, 'سهام عادی',                       'اختیار خرید'],
		[312, 'سهام عادی',                       'اختیار فروش'],
		[600, 'اختیار',                         'اختیار فروش تبعی'],
		[602, 'اختیار',                         'اختیار فروش تبعی فرابورس'],
		[309, 'سهام عادی',                       'پایه'],
		[404, 'حق تقدم',                        'حق تقدم پایه'],
		[207, 'اوراق مشاركت',                     'اوراق مشارکت ارز صادراتی'],
		[200, 'اوراق مشاركت',                     'اوراق مشارکت انرژی'],
		[315, 'صندوق سرمايه گذاري',                  'صندوق سرمایه گذاری قابل معامله انرژی'],
		[801, 'سلف بورس انرژی',                   ''],
		[802, 'سلف بورس انرژی',                   ''],
		[803, 'سلف بورس انرژی',                   ''],
		[804, 'سلف بورس انرژی',                   ''],
		[901, 'انرژی',                         ''],
		[902, 'انرژی',                         ''],
		[308, 'اوراق مشاركت',                     'اوراق مشارکت کالا'],
		[701, 'کالا',                          'گواهی سپرده کالایی'],
	]
QPasCotFxeVal    // تيک
QQtTranMarVal    // کوچک ترين تعداد سهام قابل معامله
Flow             // بازار
	[
		[0, 'عمومي - مشترک بين بورس و فرابورس'],
		[1, 'بورس'],
		[2, 'فرابورس'],
		[3, 'آتی'],
		[4, 'پایه فرابورس'],
		[5, 'پایه فرابورس - منتشر نمی شود'],
		[6, 'بورس انرژی'],
		[7, 'بورس کالا'],
	] 
QtitMinSaiOmProd // حداقل حجم مجاز قابل سفارش
QtitMaxSaiOmProd // حداکثر حجم مجاز قابل سفارش
Valid            // اعتبار نماد
	0	'قدیمی و حذف شده'
	1 'معتبر'